/********************************************************************/
/*ヘッダーファイル													*/
/********************************************************************/
#include "main.h"
/********************************************************************/
/*ワークエリア定義													*/
/********************************************************************/


/********************************************************************/
/*AD変換モジュール初期化関数										*/
/*void ad_initialize(void)											*/
/********************************************************************/
//乱数生成用のAD変換
//10ビットADコンバーター使用
//P40、AN0
void ad_initialize(void)
{
	SYSTEM.MSTPCRA.BIT.MSTPA23			= 0;//10ビットA/Dコンバーター（ユニット０）モジュールストップ解除
	AD0.ADCSR.BIT.ADIE		= 1;//ADI割り込み禁止
	AD0.ADCR.BIT.MODE		= 2;//動作モード連続スキャンモード
	AD0.ADCR.BIT.CKS		= 3;//ADCLK = 48MHz
	AD0.ADCR.BIT.TRGS		= 0;//ソフトウェアトリガ
	AD0.ADCSR.BIT.ADST		= 1;//A/D変換開始
}

/********************************************************************/
/*AD値取得															*/
/*unsigned short get_ad_value(void)									*/
/********************************************************************/
unsigned short get_ad_value(void)
{
	return AD0.ADDRA;
}
